Ekpenyong-Esu/STM32F429I_DISC1_CMAKE_PROJECT/Peripherals/CAN/can.h
/**
 * @file can.h
 * @brief CAN (Controller Area Network) peripheral driver for STM32F429
 * @author Generated by GitHub Copilot
 * @date 2025
 *
 * This driver provides a comprehensive interface for the CAN peripheral
 * on STM32F429 microcontrollers. It supports both standard and extended
 * CAN frames, configurable baud rates, filter management, and interrupt
 * handling for robust automotive and industrial communication.
 */

#ifndef CAN_H
#define CAN_H

#include "stm32f4xx.h"
#include "stm32f4xx_hal_can.h"
#include <stdint.h>
#include <stdbool.h>

/* CAN Configuration Constants */
#define CAN_MAX_DATA_LENGTH         8U
#define CAN_MAX_FILTER_BANKS        14U
#define CAN_MAX_MAILBOXES           3U

/* CAN Baud Rate Presets */
#define CAN_BAUD_1000KBPS           1000000U
#define CAN_BAUD_500KBPS            500000U
#define CAN_BAUD_250KBPS            250000U
#define CAN_BAUD_125KBPS            125000U
#define CAN_BAUD_100KBPS            100000U
#define CAN_BAUD_50KBPS             50000U
#define CAN_BAUD_20KBPS             20000U
#define CAN_BAUD_10KBPS             10000U

/* CAN Frame Types */
typedef enum {
    CAN_FRAME_STANDARD = 0U,
    CAN_FRAME_EXTENDED = 1U
} CAN_FrameType;

/* CAN Error Types */
typedef enum {
    CAN_ERROR_NONE = 0,
    CAN_ERROR_STUFF = 1,
    CAN_ERROR_FORM = 2,
    CAN_ERROR_ACK = 3,
    CAN_ERROR_BIT_RECESSIVE = 4,
    CAN_ERROR_BIT_DOMINANT = 5,
    CAN_ERROR_CRC = 6,
    CAN_ERROR_BUS_OFF = 7,
    CAN_ERROR_BUS_PASSIVE = 8,
    CAN_ERROR_BUS_WARNING = 9
} CAN_ErrorType;

/* CAN Operating Mode - Using HAL-defined constants */
typedef uint32_t CAN_OperatingMode;

/* CAN Operating Mode Constants (HAL-compatible) */
#define CAN_OP_MODE_NORMAL          CAN_MODE_NORMAL
#define CAN_OP_MODE_LOOPBACK        CAN_MODE_LOOPBACK
#define CAN_OP_MODE_SILENT          CAN_MODE_SILENT
#define CAN_OP_MODE_SILENT_LOOPBACK CAN_MODE_SILENT_LOOPBACK

/* CAN Filter Mode - Using HAL-defined constants */
typedef uint32_t CAN_FilterMode;

/* CAN Filter Mode Constants (HAL-compatible) */
#define CAN_FILTER_MODE_ID_MASK     CAN_FILTERMODE_IDMASK
#define CAN_FILTER_MODE_ID_LIST     CAN_FILTERMODE_IDLIST

/* CAN Filter Scale - Using HAL-defined constants */
typedef uint32_t CAN_FilterScale;

/* CAN Filter Scale Constants (HAL-compatible) */
#define CAN_FILTER_SCALE_16BIT      CAN_FILTERSCALE_16BIT
#define CAN_FILTER_SCALE_32BIT      CAN_FILTERSCALE_32BIT

/* CAN Frame Structure */
typedef struct {
    uint32_t id;                           /* CAN ID (11-bit for standard, 29-bit for extended) */
    CAN_FrameType frame_type;              /* Standard or Extended frame */
    uint8_t data_length;                   /* Data length (0-8 bytes) */
    uint8_t data[CAN_MAX_DATA_LENGTH];     /* Data payload */
    bool remote_request;                   /* Remote Transmission Request */
    uint32_t timestamp;                    /* Timestamp (if supported) */
} CAN_Frame;

/* CAN Configuration Structure */
typedef struct {
    CAN_OperatingMode mode;                /* Operating mode */
    uint32_t baud_rate;                    /* Baud rate in bps */
    bool auto_retransmission;              /* Auto retransmission enable */
    bool auto_bus_off_recovery;            /* Auto bus-off recovery enable */
    bool time_triggered_comm;              /* Time-triggered communication mode */
    uint32_t prescaler;                    /* Time quanta prescaler */
    uint32_t sync_jump_width;              /* Synchronization jump width */
    uint32_t time_segment_1;               /* Time segment 1 */
    uint32_t time_segment_2;               /* Time segment 2 */
} CAN_Config;

/* CAN Filter Configuration */
typedef struct {
    uint8_t filter_bank;                   /* Filter bank number (0-13) */
    CAN_FilterMode mode;                   /* Filter mode (mask or list) */
    CAN_FilterScale scale;                 /* Filter scale (16-bit or 32-bit) */
    uint32_t id;                           /* Filter ID */
    uint32_t mask;                         /* Filter mask (for mask mode) */
    bool enable;                           /* Filter enable flag */
} CAN_FilterConfig;

/* CAN Status Structure */
typedef struct {
    bool initialized;                      /* Driver initialized flag */
    uint32_t tx_mailbox_free;              /* Number of free transmit mailboxes */
    uint32_t rx_messages_pending;          /* Number of pending receive messages */
    CAN_ErrorType last_error;              /* Last error type */
    uint32_t error_count;                  /* Total error count */
    uint32_t tx_count;                     /* Total transmitted messages */
    uint32_t rx_count;                     /* Total received messages */
} CAN_Status;

/* Function Prototypes */

/**
 * @brief Initialize the CAN peripheral with specified configuration
 * @param config Pointer to CAN configuration structure
 * @return HAL_StatusTypeDef HAL status
 */
HAL_StatusTypeDef CAN_Init(const CAN_Config *config);

/**
 * @brief Deinitialize the CAN peripheral
 * @return HAL_StatusTypeDef HAL status
 */
HAL_StatusTypeDef CAN_DeInit(void);

/**
 * @brief Configure CAN filter
 * @param filter_config Pointer to filter configuration structure
 * @return HAL_StatusTypeDef HAL status
 */
HAL_StatusTypeDef CAN_ConfigFilter(const CAN_FilterConfig *filter_config);

/**
 * @brief Transmit a CAN frame
 * @param frame Pointer to CAN frame structure
 * @param timeout Timeout value in milliseconds
 * @return HAL_StatusTypeDef HAL status
 */
HAL_StatusTypeDef CAN_Transmit(const CAN_Frame *frame, uint32_t timeout);

/**
 * @brief Receive a CAN frame
 * @param frame Pointer to CAN frame structure to store received data
 * @param timeout Timeout value in milliseconds
 * @return HAL_StatusTypeDef HAL status
 */
HAL_StatusTypeDef CAN_Receive(CAN_Frame *frame, uint32_t timeout);

/**
 * @brief Check if transmit mailbox is available
 * @return bool True if mailbox available, false otherwise
 */
bool CAN_IsTransmitMailboxAvailable(void);

/**
 * @brief Check if receive FIFO has pending messages
 * @param fifo_number FIFO number (0 or 1)
 * @return bool True if messages pending, false otherwise
 */
bool CAN_IsReceivePending(uint8_t fifo_number);

/**
 * @brief Get number of pending messages in receive FIFO
 * @param fifo_number FIFO number (0 or 1)
 * @return uint8_t Number of pending messages
 */
uint8_t CAN_GetReceivePendingCount(uint8_t fifo_number);

/**
 * @brief Abort transmission for specified mailbox
 * @param mailbox_number Mailbox number (0-2)
 * @return HAL_StatusTypeDef HAL status
 */
HAL_StatusTypeDef CAN_AbortTransmit(uint8_t mailbox_number);

/**
 * @brief Set CAN operating mode
 * @param mode Operating mode
 * @return HAL_StatusTypeDef HAL status
 */
HAL_StatusTypeDef CAN_SetMode(CAN_OperatingMode mode);

/**
 * @brief Get current CAN status
 * @param status Pointer to status structure
 * @return HAL_StatusTypeDef HAL status
 */
HAL_StatusTypeDef CAN_GetStatus(CAN_Status *status);

/**
 * @brief Clear error counters and flags
 * @return HAL_StatusTypeDef HAL status
 */
HAL_StatusTypeDef CAN_ClearErrors(void);

/**
 * @brief Register callback for transmit complete event
 * @param callback Function pointer to callback
 */
void CAN_RegisterTxCallback(void (*callback)(uint8_t mailbox));

/**
 * @brief Register callback for receive complete event
 * @param callback Function pointer to callback
 */
void CAN_RegisterRxCallback(void (*callback)(const CAN_Frame *frame));

/**
 * @brief Register callback for error event
 * @param callback Function pointer to callback
 */
void CAN_RegisterErrorCallback(void (*callback)(CAN_ErrorType error));

/**
 * @brief Enable CAN interrupts
 * @return HAL_StatusTypeDef HAL status
 */
HAL_StatusTypeDef CAN_EnableInterrupts(void);

/**
 * @brief Disable CAN interrupts
 * @return HAL_StatusTypeDef HAL status
 */
HAL_StatusTypeDef CAN_DisableInterrupts(void);

/**
 * @brief Get CAN peripheral handle (for advanced usage)
 * @return CAN_HandleTypeDef* Pointer to CAN handle
 */
CAN_HandleTypeDef* CAN_GetHandle(void);

#endif /* CAN_H */
